In [1]:
import pandas as pd

In [2]:
# Series
# Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively referred to as the index.
s = pd.Series([1, 3, 5, 7, 9])
print(s)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [3]:
# Create a Series from a dictionary
data = {'a': 0, 'b': 1, 'c': 2}
s = pd.Series(data)
print(s)

a    0
b    1
c    2
dtype: int64

In [4]:
data = [10,20,30,40,50]
index = ['a', 'b', 'c', 'd', 'e']
s = pd.Series(data, index=index)
print(s)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
# DataFrame
# DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects.
data = {
    'Name': ['Tom', 'Jerry', 'Mickey', 'Donald'],
    'Age': [20, 21, 22, 23]
}
df = pd.DataFrame(data)
print(df)

     Name  Age
0     Tom   20
1   Jerry   21
2  Mickey   22
3  Donald   23

In [6]:
# Create a DataFrame from a dictionary of Series
data = {
    'Name': pd.Series(['Tom', 'Jerry', 'Mickey', 'Donald']),
    'Age': pd.Series([20, 21, 22, 23])
}
df = pd.DataFrame(data)
print(df)

     Name  Age
0     Tom   20
1   Jerry   21
2  Mickey   22
3  Donald   23

In [7]:
data = {'Name':['Krish','Spiderman','Ironman','Thor'],
        'Age':[23,22,25,24],
        'Address':['Hyd','USA','USA','Asgard']
    }
df = pd.DataFrame(data)
print(df)
type(df)

        Name  Age Address
0      Krish   23     Hyd
1  Spiderman   22     USA
2    Ironman   25     USA
3       Thor   24  Asgard

pandas.core.frame.DataFrame

In [8]:
data = [
    {'Name':'Krish', 'Age':23, 'Address':'Hyd'},
    {'Name':'Spiderman', 'Age':22, 'Address':'USA'},
    {'Name':'Ironman', 'Age':25, 'Address':'USA'},
    {'Name':'Thor', 'Age':24, 'Address':'Asgard'}
]
df = pd.DataFrame(data)
print(df)

        Name  Age Address
0      Krish   23     Hyd
1  Spiderman   22     USA
2    Ironman   25     USA
3       Thor   24  Asgard

In [9]:
df

        Name  Age Address
0      Krish   23     Hyd
1  Spiderman   22     USA
2    Ironman   25     USA
3       Thor   24  Asgard

In [10]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,Date,Day,Month,Year,Customer_Age,Age_Group,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
0,2013-11-26,26,November,2013,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
1,2015-11-26,26,November,2015,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
2,2014-03-23,23,March,2014,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,23,45,120,1366,1035,2401
3,2016-03-23,23,March,2016,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,20,45,120,1188,900,2088
4,2014-05-15,15,May,2014,47,Adults (35-64),F,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,4,45,120,238,180,418

In [11]:
df.tail(5)

,Date,Day,Month,Year,Customer_Age,Age_Group,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
113031,2016-04-12,12,April,2016,41,Adults (35-64),M,United Kingdom,England,Clothing,Vests,"Classic Vest, S",3,24,64,112,72,184
113032,2014-04-02,2,April,2014,18,Youth (<25),M,Australia,Queensland,Clothing,Vests,"Classic Vest, M",22,24,64,655,528,1183
113033,2016-04-02,2,April,2016,18,Youth (<25),M,Australia,Queensland,Clothing,Vests,"Classic Vest, M",22,24,64,655,528,1183
113034,2014-03-04,4,March,2014,37,Adults (35-64),F,France,Seine (Paris),Clothing,Vests,"Classic Vest, L",24,24,64,684,576,1260
113035,2016-03-04,4,March,2016,37,Adults (35-64),F,France,Seine (Paris),Clothing,Vests,"Classic Vest, L",23,24,64,655,552,1207

In [12]:
# Accessing Data from DataFrame
data = {'Name':['Krish','Spiderman','Ironman','Thor'],
        'Age':[23,22,25,24],
        'City':['Hyd','USA','USA','Asgard']
    }
df = pd.DataFrame(data)
df

        Name  Age    City
0      Krish   23     Hyd
1  Spiderman   22     USA
2    Ironman   25     USA
3       Thor   24  Asgard

In [13]:
df['Name']

0        Krish
1    Spiderman
2      Ironman
3         Thor
Name: Name, dtype: object

In [14]:
df.loc[0]

Name    Krish
Age        23
City      Hyd
Name: 0, dtype: object

In [15]:
df.iloc[0]

Name    Krish
Age        23
City      Hyd
Name: 0, dtype: object

In [16]:
df.loc[0][0]

C:\Users\tarak\AppData\Local\Temp\ipykernel_39624\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Krish'

In [17]:
df.loc[0]['Name']

'Krish'

In [18]:
df.loc[0:2]

        Name  Age City
0      Krish   23  Hyd
1  Spiderman   22  USA
2    Ironman   25  USA

In [19]:
# Accessing a specified element
print(df.at[1,'Age'])

22

In [20]:
print(df.iat[1,2])

USA

In [21]:
df['Salary'] = [1000, 2000, 3000, 4000]
df

        Name  Age    City  Salary
0      Krish   23     Hyd    1000
1  Spiderman   22     USA    2000
2    Ironman   25     USA    3000
3       Thor   24  Asgard    4000

In [22]:
df.drop('Salary', axis=1)

        Name  Age    City
0      Krish   23     Hyd
1  Spiderman   22     USA
2    Ironman   25     USA
3       Thor   24  Asgard

In [23]:
df

        Name  Age    City  Salary
0      Krish   23     Hyd    1000
1  Spiderman   22     USA    2000
2    Ironman   25     USA    3000
3       Thor   24  Asgard    4000

In [24]:
df.drop('Salary', axis=1, inplace=True)

In [25]:
df

        Name  Age    City
0      Krish   23     Hyd
1  Spiderman   22     USA
2    Ironman   25     USA
3       Thor   24  Asgard

In [26]:
df.drop(0)

        Name  Age    City
1  Spiderman   22     USA
2    Ironman   25     USA
3       Thor   24  Asgard

In [27]:
df

        Name  Age    City
0      Krish   23     Hyd
1  Spiderman   22     USA
2    Ironman   25     USA
3       Thor   24  Asgard

In [28]:
df.drop(1, inplace=True)

In [29]:
df

      Name  Age    City
0    Krish   23     Hyd
2  Ironman   25     USA
3     Thor   24  Asgard